[
    {
        "content": "Chinese telecom company Huawei Technologies Co has cut its India revenue target for 2020 by up to 50% and is laying off more than half of its staff in the country, the Economic Times reported on Monday, amid calls to boycott Chinese goods."
    },
    {
        "content": "The NSE Nifty 50 index closed down 0.56 per cent to 11,131.8 and the benchmark S&P BSE Sensex ended 0.51 per cent lower at 37,934.73."
    },
    {
        "content": "Coronavirus pandemic has complicated economic revival of India. The country was already in the grip of economic slowdown, and now the central government is facing acute revenue crunch. Can a return to the approach of the RBI monetising deficit solve the problem?"
    },
    {
        "content": "Indian shares inched lower on Monday, dragged by banking stocks, after a central bank report said bad loan ratios could soar in the future, while a continued rise in domestic cases of the novel coronavirus further dented hopes of an economic recovery."
    },
    {
        "content": "Bitcoin breached $10,000 on Sunday for the first time since early June. On Sunday, the cryptocurrency hit highs of $10,200."
    },
    {
        "content": "Hoteliers in Karnataka have also urged the state government to waive of excise fee for hotels and bars for a period of one year."
    },
    {
        "content": "The investigator, Ashok Kumar Malhotra, a former DIG level officer of Central Bureau of Investigation (CBI), also cleared all accusations against the Income Tax department and said Siddhartha was never harassed by IT officials, who were earlier being held responsible for Sidhartha's suicide."
    },
    {
        "content": "India, the world's third-biggest oil consumer and importer, received 3.2 million barrels per day (bpd) oil in June, a decline of 0.4 per cent from May and about 28.5 per cent from a year ago, the data showed."
    },
    {
        "content": "The mood darkened after Beijing ordered Washington to close the US consulate in Chengdu, in retaliation for China being told to shut its consulate in Houston earlier this week."
    },
    {
        "content": "The Drug Controller General of India granted Cipla accelerated approval to make and sell favipiravir in an effort to meet the urgent and unmet need for COVID-19 treatment options in the country, the company said."
    },
    {
        "content": "The financial system in India remains sound; need for financial intermediaries to proactively augment capital and improve their resilience has acquired top priority, RBI Governor Shaktikanta Das said in his foreword to the bi-annual Financial Stability Report (FSR)."
    },
    {
        "content": "Indian shares ended marginally lower on Friday as investors elected to book profits following a record jump in daily domestic coronavirus cases, while a Reliance Industries rally capped the losses."
    },
    {
        "content": "Even after losing a staggering $6.29 billion, Jeff Bezos's net worth stands at $178 billion. It is more than the combined value of Nike, McDonald's Corp and more."
    },
    {
        "content": "Gold prices have risen more than 4 per cent this week, putting gold on course for its longest winning streak since late 2011."
    },
    {
        "content": "The NSE Nifty 50 index fell 0.75% at 11,132.50 by 0350 GMT and the benchmark S&P BSE Sensex was down 0.82% at 37,829.60. However, both indexes were on track for a fifth straight week of gains."
    },
    {
        "content": "The dollar slid to 22-month lows against a basket of currencies. A weaker dollar usually spurs buying of commodities priced in the greenback, like oil, because they become cheaper for holders of other currencies."
    },
    {
        "content": "For once, currencies have dominated trading as a deal on a European Union recovery plan shot the euro to its highest since late 2018. The single currency was last standing tall at $1.1616 having climbed 1.7% for the week so far."
    },
    {
        "content": "The move is seen as New Delhi's latest effort to counter China following a border clash between the two nations."
    },
    {
        "content": "Indian shares climbed on Thursday as signs of New Delhi and Washington getting closer to agreeing to a trade deal amid escalating Sino-US tensions buoyed sentiment, while Reliance Industries gained on reports of a potential investment by Amazon."
    },
    {
        "content": "Sources said that a decision has not been taken but a blueprint that may keep Huawei and ZTE, another Chinese company, out is work in progress."
    },
    {
        "content": "Many responders who said they missed going to office cited lack of human interaction and socialising as the primary reason."
    },
    {
        "content": "The interest rate on home loans up to Rs 50 lakh will start from 6.90 per cent for borrowers who have a Cibil score of 700 or more. However, if the home loan amount goes up, the interest rate will also increase marginally above 7 per cent."
    },
    {
        "content": "The deal will allow Flipkart to launch a digital marketplace called Flipkart Wholesale next month, the Bengaluru-headquartered firm said, without disclosing any financial details of the deal."
    },
    {
        "content": "The government has already announced a raft of measures including direct food subsidy to nearly 810 million people and credit guarantees of 3 trillion rupees ($40.17 billion) on loans to small businesses."
    },
    {
        "content": "It is a major development for the SpiceJet, especially at a time when the pandemic has disrupted the entire aviation sector."
    },
    {
        "content": "Rossari Biotech made its debut on Thursday after its IPO was held from July 13 to 15. The IPO received bids for nearly 65 crore shares against the total issue size of 81, 73,530 shares."
    },
    {
        "content": "The NSE Nifty 50 index rose 0.31% to 11,167.25 by 0404 GMT and the S&P BSE Sensex gained 0.16% to 37,929.81, led by pharma stocks."
    },
    {
        "content": "Local gold futures reached an all-time high of 50,085 Indian rupees ($671.61) per 10 grams on Wednesday, taking their gains to 28% in 2020 after rising a quarter in 2019."
    },
    {
        "content": "Cabin crew members would see their all other allowances like check allowance, flying allowance and quick return allowance reduced by 20 per cent, the internal order said."
    },
    {
        "content": "The Enforcement Directorate has summoned Ratan Kant Sharma, a business partner of Rajasthan Chief Minister Ashok Gehlot's in connection with a money laundering case lodged against him, amid the political crisis."
    },
    {
        "content": "The NSE Nifty 50 index .NSEI, up 1.27% last week after a series of surprisingly upbeat reports from some of the country's biggest companies, fell 0.27% to 11,132.60."
    },
    {
        "content": "According to Forbes, Mukesh Ambani's net worth at $75 billion is currently more than Google founders Larry Page and Sergey Brin, American investor and philanthropist Warren Buffet and Tesla CEO Elon Musk."
    },
    {
        "content": "Local gold futures reached an all-time high of 49,996 rupees ($670.32) per 10 grams in early trade, taking their gains to 28% in 2020 after rising a quarter in 2019."
    },
    {
        "content": "Experts said that the move could lead to fuel delivery becoming a major market in India. It will also increase demand for diesel in future, they added."
    },
    {
        "content": "The banking sector is currently divided on extending the moratorium period on loan payments. The current moratorium deadline ends on August 31, 2020."
    },
    {
        "content": "The NSE Nifty 50 index fell 0.12% to 11,147.20 by 9:30 am and the S&P BSE Sensex declined 0.17% at 37,665.40."
    },
    {
        "content": "India is seeking concessions for generic drugs it exports to the United States in return for opening its dairy markets and slashing tariffs on farm goods as the two sides seek to clinch a new trade accord."
    },
    {
        "content": "Indicators show green shoots in the economy with electricity and fuel consumption, inter and intra-state movement of goods, PMI data and retail financial transactions witnessing a pick-up, Finance Minister Nirmala Sitharaman said."
    },
    {
        "content": "The Enforcement Directorate (ED) has attached properties worth Rs 12.98 crore of Kamal Mehta, former Chairman of Jodhpur National University and his family member in connection with issuance of fake degrees and mark-sheets case."
    },
    {
        "content": "Benchmark Brent crude was up 31 cents at $43.59 by 0743 GMT, while West Texas Intermediate (WTI) gained 19 cents to $41.00. The closing prices of both have traded within a $2 channel so far in July."
    },
    {
        "content": "Jeff Bezos's net worth swelled a mammoth $74.4 billion in 2020 and his total fortune is now worth $189 billion. This despite the major economic depression caused by the coronavirus pandemic."
    },
    {
        "content": "Mumbai-based think tank CMIE said rural unemployment has gone up from 6.34 per cent to 7.1 per cent in the week ended July 19. The fresh data indicates rural employment recovery has stalled due to the end of the summer sowing season."
    },
    {
        "content": "Spot gold was up 0.1 per cent at $1,817.23 per ounce by 0300 GMT, after hitting its highest since September 2011 at $1,820.06 on Monday. U.S. gold futures were little changed at $1,817.80."
    },
    {
        "content": "The NSE Nifty 50 index rose 1.04% to 11,137.3 by 9:21 am, while the benchmark S&P BSE Sensex was up 1.13% at 37,839.03, after hitting their highest levels since March 5 in early trade."
    },
    {
        "content": "European Union leaders have finally reached a deal to finalise a post-pandemic package for the economic recovery of the 27-nation bloc. At least $750 billion euros will be offered in grants and loans to counter the effects of Covid-induced recession."
    },
    {
        "content": "On July 1, the United Nations Conference on Trade and Development (UNCTAD) said that the world tourism sector could lose at least $1.2 trillion or 1.5 per cent of the global gross domestic product (GDP) after having hit for nearly four months by the coronavirus pandemic."
    },
    {
        "content": "India is seeking concessions for generic drugs it exports to the United States in return for opening its dairy markets and slashing tariffs on farm goods as the two sides seek to shore up a new trade deal, three sources said."
    },
    {
        "content": "With the coronavirus pandemic cutting the tourism industry to size, air carrier IndiGo has announced it will be laying off 10 per cent of its workforce."
    },
    {
        "content": "Indian shares ended higher for a fourth straight session on Monday as HDFC Bank's (HDBK.NS) results added to last week's upbeat showing from IT companies, countering the impact of a surge in domestic coronavirus cases past one million."
    },
    {
        "content": "During a visit to India in January, Amazon boss Jeff Bezos said the US e-commerce company would invest $1 billion in digitising small- and medium-businesses in India and expected to export Indian-made goods worth $10 billion by 2025."
    },
    {
        "content": "While consumer gloom has eased after UK relaxed coronavirus restrictions, unemployment is forecast to increase dramatically later this year when a temporary government scheme that has support more than 9 million jobs ends in October."
    },
    {
        "content": "India's biggest private-sector lender, HDFC Bank on Saturday reported a 20% rise in first-quarter profit, sending its shares up as much as 3.33% in early trade."
    },
    {
        "content": "The faceless tax assessment was launched by Finance Minister Nirmala Sitharaman on October 7, 2019, in a bid to protect taxpayers from harassment. In the faceless assessment system, all communication with the taxpayer is done electronically."
    },
    {
        "content": "Indian Oil Corp Ltd's 300,000 barrels per day refinery on the country's east coast to be shut for three weeks for maintenance, the top district administrative official told Reuters on Sunday."
    },
    {
        "content": "The SC also remarked that the situation of homebuyers in Noida and Greater Noida remains the same since there is no progress in the pace of unfinished housing projects."
    },
    {
        "content": "Spot gold rose 0.3% to $1,802.61 per ounce by 0942 GMT. US gold futures were up 0.2% at $1,803.30."
    },
    {
        "content": "Indian shares ended higher for a third consecutive session on Friday, as gains in financial and energy stocks and hopes of strong corporate earnings outweighed concerns over surging domestic coronavirus cases that crossed the one million mark."
    },
    {
        "content": "The quarterly survey sees the economy shrinking by 8.3% this year, a downgrade from its May projection for a 5.5% drop but a more benign outcome than the ECB staff's own estimate for an 8.7% drop."
    },
    {
        "content": "India's richest woman Roshni Nadar Malhotra assumed charge as the HCL chairperson after her father, Shiv Nadar, stepped down from the position on Friday."
    },
    {
        "content": "A total of 1377 exporters, who fraudulently claimed IGST refund amounting to Rs 1,875 crore have been found untraceable at their principal place of business."
    },
    {
        "content": "Shiv Nadar will continue to be the managing director of the company with designation as the chief strategy officer of the company, HCL said in a release."
    },
    {
        "content": "In the Mumbai market, corporate earnings among blue-chip companies have so far been positive with IT majors Infosys, Wipro and HCL Technologies beating estimates and only Tata Consultancy Services missing."
    },
    {
        "content": "Indian shares closed higher on Thursday, led by gains in pharmaceutical and IT stocks, even though coronavirus cases in the world's second-most populous nation inched towards one million."
    },
    {
        "content": "Rising fuel prices and rains have pushed vegetable up significantly. People in Lucknow want the government to keep a check on the prices of essential commodities."
    },
    {
        "content": "A group of the world's top oil companies, including Saudi Aramco, China's CNPC and Exxon Mobil, have for the first time set goals to cut their greenhouse gas emissions as a proportion of output, as pressure on the sector's climate stance grows."
    },
    {
        "content": "Billionaires are now looking to pull that money from equities and put the profits in illiquid and private assets."
    },
    {
        "content": "Having cut its key lending rate by an aggressive 115 basis points (bps) in 2020, on top of 135 bps cuts in 2019, the RBI so far has had little success in spurring credit growth amid varying degrees of lockdowns across India."
    },
    {
        "content": "Power generation fell 3.1% in the first 15 days of July compared with the same period last year, a Reuters analysis of daily load despatch data from federal grid operator POSOCO showed, compared with a 9.9% fall in June."
    },
    {
        "content": "The number of employees on company payrolls tumbled by 649,000 between March and June, but the largest falls came at the start of the lockdown, the Office for National Statistics said on Thursday."
    },
    {
        "content": "Microsoft co-founder and philanthropist Bill Gates has praised India's pharmaceutical industry and said that it has the capability to produce Covid-19 vaccines for the entire world."
    },
    {
        "content": "The institute said that the generous gift from Mittal has secured the future of a critical professorship in vaccinology at the university and will help in critical vaccine development."
    },
    {
        "content": "Abhijit Banerjee made it clear that the only way to reduce economic distress in the short run is by giving more money to poorer sections of society."
    },
    {
        "content": "The Organisation of the Petroleum Exporting Countries and other nations agreed to ease up on cuts during a video conference Wednesday."
    },
    {
        "content": "China's economy rebounded from a painful contraction to grow by 3.2 per cent over a year earlier in the latest quarter as anti-virus lockdown were lifted and factories and stores reopened."
    },
    {
        "content": "Domestic markets witnessed a rise in volatility on Thursday due to rising coronavirus case. IT stocks, however, came to the rescue with Infosys rising over 10 per cent after posting better-than-expected company results."
    },
    {
        "content": "Indian exports and imports have been falling since March and worsening India-China relations, shrinking global demand and disruptions in supply chains are likely to pressure the trade outlook over the next few quarters."
    },
    {
        "content": "This gives us a powerful foundation for the rest of the year, Infosys CEO and Managing Director Salil Parekh said."
    },
    {
        "content": "The trade deficit stood at USD 9.12 billion during the two months of the current fiscal."
    },
    {
        "content": "In a communiqu  to Union Commerce Minister Piyush Goyal on June 15, CAIT had raised the demand for 'Country of Origin' listing and value addition norms for e-marketplaces."
    },
    {
        "content": "India's most valuable stock, Reliance, which was up 3.2% ahead of its AGM, erased all its gains and fell as much as 6.21% in the session."
    },
    {
        "content": "RIL AGM Meet: In his speech, Mukesh Ambani spoke about the bumper investments from Google, Facebook and other global tech giants in Reliance Jio; building an indigenous 5G platform from scratch; to the future of Jio Platforms."
    },
    {
        "content": "Reliance chairman Mukesh Ambani made a series of important announcements about the company's future at an annual general meeting. Ambani announced that Google will be investing Rs Rs 33,737 crore in Reliance's Jio Platforms and that that company will be launching its own 5G platform soon."
    },
    {
        "content": "India's most valuable stock surged over 1 per cent in morning trade and has been climbing steadily as investors gear up for announcements in the AGM. At around 11:40 am, RIL shares were trading higher by 2.87 per cent."
    },
    {
        "content": "The price of diesel has been hiked by 13 paise on Wednesday and it is now available for Rs 81.18 per litre in Delhi. Petrol price, however, remains the same and has not been hiked since June 29."
    },
    {
        "content": "India's most valuable stock Reliance Industries rose about 1.1% ahead of an annual general meeting due later in the day."
    },
    {
        "content": "While inflation in vegetables and onion stood at (-) 9.21 per cent and (-) 15.27 per cent, respectively; potato saw a spike in prices with inflation at 56.20 per cent. Pulses too saw rise in cost with inflation at 10.10 per cent, while the same for wheat was 5.17 per cent during June."
    },
    {
        "content": "The broader NSE Nifty 50 index closed down 1.81% at 10,607.35 and the benchmark S&P BSE Sensex ended 1.8% lower at 36,033.06, dragged by losses in banking and auto stocks."
    },
    {
        "content": "Aviation Industry Employees Guild and All India Service Engineers Association have slammed the Indian Commercial Pilots' Association (ICPA) and Indian Pilots' Guild (IPG) for their recent letter to Air India CMD regarding ways to reduce financial stress."
    },
    {
        "content": "According to the latest Bloomberg Billionaires Index, Ambani's net worth now stands at $72.4 billion (Rs 5.44 lakh crore) after a rise of $2.17 billion."
    },
    {
        "content": "The broader NSE Nifty 50 index fell 0.68% at 10,729.75 by 9:15 am and the benchmark S&P BSE Sensex was down 0.74% at 36,423.79."
    },
    {
        "content": "The economy shrank 41.2 percent quarter-on-quarter and 12.6 percent on-year between April and June, according to data from the trade ministry, and analysts said it was the worst quarterly figure for gross domestic product ever recorded in Singapore."
    },
    {
        "content": "The Treasury Department reported Monday that the deficit hit $864 billion last month, an amount of red ink that surpasses most annual deficits in the nation's history and is above the previous monthly deficit record of $738 billion in April."
    },
    {
        "content": "During the four-hour trading session, the domestic unit witnessed an intra-day high of 75.08 and a low of 75.21 against the US dollar."
    },
    {
        "content": "Wall Street banks JPMorgan, Citigroup and Wells Fargo are set to kick off on Tuesday a US results season that Refinitiv data suggests will show the second-biggest quarterly drop in corporate earnings since 1968."
    },
    {
        "content": "Gains were capped by declines in the banking and financial sectors after rating agency Moody's warned of challenging economic and credit conditions stemming from Covid-19 for Indian banks."
    },
    {
        "content": "Driven by hike in food prices, retail inflation rose by 6.09 per cent in June."
    },
    {
        "content": "Gains were capped by declines in the banking and financial sectors after rating agency Moody's warned of challenging economic and credit conditions stemming from Covid-19 for Indian banks."
    },
    {
        "content": "The company's shares, which are down 1.6% to date in a tumultuous year for Wall Street, were up about 2% before the bell as investors shrugged off a fall in sales of its sodas due to widespread restaurant closures."
    },
    {
        "content": "The divestment comes as Ma retired as the Chinese e-commerce company's executive chairman in September and pulled back from formal business roles to focus on philanthropy."
    },
    {
        "content": "India has around 20,000 tonnes of gold reserve in private hands, says a report. This is more than the combined gold reserves held by the central banks of the US, Eurozone and China."
    },
    {
        "content": "Brent crude LCOc1 fell 32 cents, or 0.7%, to $42.92 a barrel by 0646 GMT while U.S. West Texas Intermediate crude CLc1 was at $40.22 a barrel, down 33 cents, or 0.8%."
    },
    {
        "content": "The medium-term outlook for the economic recovery still looks very uncertain and this continues to provide ample room for gold to float higher."
    },
    {
        "content": "As economic future remains uncertain, a meeting of the ECB could see a lively debate on what's next for the emergency bond buying program it ramped up in June."
    },
    {
        "content": "MSCI's broadest index of Asia-Pacific shares outside Japan added 1.2%, having climbed sharply last week on the back of surging Chinese stocks, which jumped another 2.3% on Monday."
    },
    {
        "content": "FICCI puts India's minimum growth estimate at (-) 6.4% and maximum growth at 1.5% for the year 2020-21."
    },
    {
        "content": "The broader NSE Nifty 50 index rose 0.82% to 10,856.05 by 9:15 am and the benchmark S&P BSE Sensex was up 0.83% at 36,898.33."
    },
    {
        "content": "The partnership will help Jio Platforms, the unit that houses Reliance's telecoms venture Jio Infocomm, to roll out advanced 5G infrastructure and services for Indian customers, Reliance said in a statement."
    },
    {
        "content": "The Enforcement Directorate (ED) probing the Yes Bank case is expected to file the second chargesheet in the case on Monday. The chargesheet, according to sources, will be against 10 to 13 accused persons and entities."
    },
    {
        "content": "Reserve Bank of India (RBI) Governor Shaktikanta Das said the 2008 global financial crisis and the current one show that such economic shocks have fatter tails than generally believed, and that the country's financial system should have larger capital buffers."
    },
    {
        "content": "Air India has withdrawn job offers for around 180 trainee cabin crew members amid the economic slowdown in the Indian aviation sector due to the coronavirus pandemic, said airline officials on Saturday."
    },
    {
        "content": "In his keynote address at the 7th SBI Banking and Economics Conclave, RBI Governor Shaktikanta Das said that the novel coronavirus pandemic is so far the biggest test of robustness and resilience of our [India's] economic and financial system."
    },
    {
        "content": "The company is a joint venture of the Chinese firm CRRC Corporation Ltd with a Gurugram-based company, according to its website. The company is bidding for a project of the Vande Bharat trains."
    },
    {
        "content": "India said on Friday it was suspending the release of headline industrial output numbers for May, part of a more-than two-month lockdown imposed to combat the coronavirus pandemic, due to inadequate data collection."
    },
    {
        "content": "Sensex dropped 143.36 points to end at 36,594.33 and Nifty slipped 45.40 points to 10,768.05."
    },
    {
        "content": "Businesses from textiles to sports goods and furniture are shuttered or working at a bare minimum, and cows roam streets that would be normally packed with workers and vehicles."
    },
    {
        "content": "While new pandemic-proof policies might not be cheap, they offer businesses from restaurants to film production companies to e-commerce retailers ways of insuring against disruptions and losses if another virus strikes."
    },
    {
        "content": "Dow, who joined the company in April 2018, steered the Carmichael mine and rail project through a drawn-out and hotly contested permitting process, and then its first year of construction."
    },
    {
        "content": "Spot gold was little changed at $1,801.47 per ounce by 0249 GMT, up nearly 1.5 per cent for the week. US gold futures rose 0.2 per cent to $1,806.80."
    },
    {
        "content": "Consumption of refined fuels, a proxy for oil demand, rose to 16.29 million tonnes in June, 11% above the prior month, data from the Petroleum Planning and Analysis Cell (PPAC) of the Ministry of Petroleum & Natural Gas showed."
    },
    {
        "content": "Indian state-owned lender PNB, which was hit by a $2 billion fraud involving billionaire Nirav Modi in 2018, had already set aside 12.5 billion rupees in provisions for the loans to DHFL, which is in bankruptcy proceedings."
    },
    {
        "content": "The NSE Nifty 50 index fell 0.27 per cent to 10,784.5 by 0357 GMT, while the benchmark S&P BSE Sensex was down 0.25 per cent at 36,645.81. The indexes were, however, headed for their fourth straight week of gains."
    },
    {
        "content": "As retail prices of tomato surged to Rs 60-70 per kg in almost all big cities, Consumer Affairs Minister Ram Vilas Paswan on Thursday said the price volatility was due to lean production season and high perishability of the commodity."
    },
    {
        "content": "The Government of India has issued a gazette notification for draft rules for the 'Code of Wages' law which is expected to benefit 50 crore workers across the country."
    },
    {
        "content": "Revenue of the company rose marginally in the first quarter of the current fiscal to Rs 38,322 crore. In the year-ago period, the same stood at Rs 38,172 crore."
    },
    {
        "content": "Indian shares closed higher as metal and financial stocks gained, with investors looking forward to another earnings season, even as coronavirus cases continue to soar both at home and abroad."
    },
    {
        "content": "The Enforcement Directorate (ED) has attached properties worth Rs 2500 crores in connection with the Yes Bank case."
    },
    {
        "content": "In its primary chargesheet against Yes Bank founder Rana Kapoor, his wife and daughters, the ED accused them of engaging in quid pro quo by offering suspicious loans to various entities including DHFL."
    },
    {
        "content": "Spot gold was little changed at $1,812.35 per ounce by 0729 GMT, after rising to its highest since September 2011 at $1,817.71 on Wednesday. U.S. gold futures inched up 0.1% to $1,822.10."
    },
    {
        "content": "Malaysian budget carrier AirAsia said earlier in the day that it was in talks to raise more than 1 billion ringgit ($234.52 million) in funds, a day after its auditor cast doubt on its ability to continue as a going concern."
    },
    {
        "content": "The July 3-8 poll median of over 35 economists showed India's retail inflation in June moderated to 5.30 per cent from March's revised 5.84 per cent, still breaching the Reserve Bank of India's medium-term target of 4.00 per cent."
    },
    {
        "content": "The NSE Nifty 50 index rose 0.43% to 10,756.40 by 9:15 am, while the benchmark S&P BSE Sensex was up 0.53% at 36,519.94."
    },
    {
        "content": "SBI-led banks' consortium represented by Barrister Marcia Shekerdemian argued that they are not secured creditors as claimed while Mallya's legal representative, Philip Marshall, said they should be pursuing the security that banks held over the United Breweries Holdings Limited."
    },
    {
        "content": "Dharavi still faces a major problem of restarting economic activities. Since things are not going to be the same as earlier   with social distancing and other norms   businesses will need to readapt. Some businesses owners also said that lack of demand has further affected their work."
    },
    {
        "content": "Airline major SpiceJet has facilitated insurance cover for Covid-19 hospitalisation which can be availed by its passengers."
    },
    {
        "content": "The outlook for the global labour market in the second half of 2020 is highly uncertain and the forecast recovery will not be enough for employment to return to pre-pandemic levels this year, the ILO said last week."
    },
    {
        "content": "Frankfurt, Paris and London all opened lower in early trading as investors shifted to wait-and- see mode before upcoming earnings and clung to the perceived safety of the U.S. dollar."
    },
    {
        "content": "The company's Indian arm in May said it would hire 50,000 temporary workers to meet a surge in online shopping in the country."
    },
    {
        "content": "The Reserve Bank of India's stated foreign exchange policy has been to only curb extreme volatility but recent actions suggest it is not letting the local unit appreciate despite its relative underperformance versus peers."
    },
    {
        "content": "The public lender said it is reducing Marginal Cost-based Lending Rate (MCLR) by 5-10 basis points to 6.65 per cent for short-term loans from July 10."
    },
    {
        "content": "Most homebuyers are angry with delay in completion of projects and builders are worried. They claim that they have less than 50 per cent labours working at sites and that is leading to a delay."
    },
    {
        "content": "There has been a sharp recovery in India's unemployment rate but it is still quite high compared to pre-lockdown levels, according to CMIE's latest update."
    },
    {
        "content": "Most central banks around the world are helping their respective governments fund record fiscal stimulus packages to deal with elevated spending during the coronavirus pandemic."
    },
    {
        "content": "The NSE Nifty 50 index rose 0.25 per cent to 10,827.05 by 9:26 am, while the benchmark S&P BSE Sensex was up 0.16 per cent at 36,732.83, both hovering near four-month highs."
    },
    {
        "content": "The underlining reason that has triggered a fresh wave of IT layoffs seems to be related to downsizing workforce in an uncertain business environment."
    },
    {
        "content": "The Nifty was down 0.02% to 10,761.45 by 0512 GMT, while the Sensex was up 0.06% at 36,510.87. Both indexes gained around 4.5% in the last four sessions, hitting their highest in four months."
    },
    {
        "content": "India's palm oil imports could plunge 20% from a year ago to 7.5 million tonnes in the 2019/20 marketing year ending on October 31."
    },
    {
        "content": "The Indian arm of global consumer giant Unilever said on July 2 it would rebrand its skin-lightening cream  Fair & Lovely' to  Glow & Lovely'."
    },
    {
        "content": "India in March said all foreign billings for digital services provided in the country would be taxed at 2% from April 1, a move that caught U.S. technology firms off guard as they were battling the coronavirus pandemic."
    },
    {
        "content": "The relaxation announced by the government will help companies freely price, store and market face masks and hand sanitisers, which have been in high demand since the novel coronavirus became a serious threat in the country."
    },
    {
        "content": "CAIT is asking traders and trade associations across the country not to use Zoom as their communication platform any further. It has also called for the adoption of JioMeet video conferencing application"
    },
    {
        "content": "At 9:30 am, Sensex was trading 78 points higher to remain over 36,500, while NSE Nifty was above 10,700 points. However, markets soon shed gains due to negativity in Asian markets."
    },
    {
        "content": "The ice cream industry in India is in a meltdown due to coronavirus-induced-lockdown. The reserve migration of labouers during the Covid lockdown has badly affected the sale of ice creams in India. For more, watch the full video."
    },
    {
        "content": "The Government of India is reviewing around 50 investment proposals involving Chinese companies under a new screening policy, three sources familiar with the matter said."
    },
    {
        "content": "The Maharashtra government on Monday launched the Mahajobs Portal which will connect the local workforce with employers online and provide employment opportunities to people of the state."
    },
    {
        "content": "Global stock markets rallied as investors bet on a revival in Chinese activity to boost global growth, even as coronavirus cases continued to surge."
    },
    {
        "content": "Spot gold was down 0.1% to $1,772.73 per ounce by 0521 GMT. U.S. gold futures fell 0.5% to $1,780.80."
    },
    {
        "content": "The letter addressed to the Air India CMD Rajiv Bansal suggests ways on what the airline should be doing at a time when the aviation sector in general and AI in particular is facing multiple challenges due to the coronavirus-induced economic slowdown."
    },
    {
        "content": "Many buy-now-pay-later (BNPL) firms have benefited from a shift to online shopping during the coronavirus crisis in countries including the United States, where state aid has also boosted retail sales."
    },
    {
        "content": "Kuwait is mulling a new law to put a cap on the number of expatriates working in the country. The bill proposes a cap of 15 per cent for Indians."
    },
    {
        "content": "The Nifty rose 0.98% to 10,711.05 by 9:22 am, while the Sensex was up 0.82% at 36,315.69, both trading near their four-month peaks."
    },
    {
        "content": "OPEC and allies including Russia, collectively known as OPEC+, have pledged to slash production by a record 9.7 million barrels per day (bpd) for a third month in July."
    },
    {
        "content": "Most markets had gained ground last week as a raft of economic data from June beat expectations, though the resurgence of coronavirus cases in the United States is clouding the future."
    },
    {
        "content": "FICCI surveyed startup founders, investors and incubators as part of its nationwide survey to assess the impact of the novel coronavirus pandemic on India's startup ecosystem."
    },
    {
        "content": "Amid high border tension between India, China, the Confederation of All India Traders wrote to Union Minister Ravi Shankar Prasad demanding to ban HUAWEI & ZTE Corporation of China from participating in the 5G network rollout in India."
    },
    {
        "content": "The ice cream industry in India has witnessed major losses to due to the coronavirus-induced-lockdown. The peak ice cream season typically starts from February to June, and this year it was badly affected by the lockdown, resulting in almost no sales. Ice cream carts have almost gone off the road due to the crisis of migrant labourers. For more, watch the special report."
    },
    {
        "content": "Germany's economy may recover from October onwards from the coronavirus pandemic, Economy Minister Peter Altmaier said in a newspaper interview on Sunday."
    },
    {
        "content": "Nandan Nilekani said at present, Indian firms like Infosys have handled the situation arising out of the Trump administration's recent decision to suspend H1B visas, but he is hopeful the situation will normalise after the US Presidential elections."
    },
    {
        "content": "After a slew of interventions by the World Bank targeted towards health and migrant labour post-Covid in India; the bank has approved a $750 mn MSME Emergency Response program to support increased flow of finance into the hands of micro, small and medium enterprises."
    },
    {
        "content": "The NSE Nifty 50 index .NSEI ended 1.52% higher at 11,300.55, and the S&P BSE Sensex closed up 1.47% at 38,492.95."
    },
    {
        "content": "The coronavirus crisis may have triggered the long-anticipated tipping point in oil demand and it is focusing minds in OPEC."
    },
    {
        "content": "The report of the deal comes at a time when Mukesh Ambani is looking to strengthening his RIL's retail business. However, neither Reliance nor Future Group has officially confirmed the deal yet."
    },
    {
        "content": "After more than a decade and a half, India will end its financial year as a net exporter. But this current account surplus, an RBI report says, is due to greater fall in imports than that in exports."
    },
    {
        "content": "SpiceJet will operate its first long-distance flight between Amsterdam, Bengaluru and Hyderabad on August 1-2. The same was confirmed by an airline spokesperson."
    },
    {
        "content": "As much as Rs 30,000 crore has been withdrawn by approximately 8 million EPFO subscribers in the last four months   April to July   in the wake of the pandemic situation in India."
    },
    {
        "content": "The Australian Bureau of Statistics (ABS) said total payroll jobs decreased 2.2% in Victoria alone as additional COVID-19 restrictions were re-introduced following an alarming rise in cases."
    },
    {
        "content": "The precious metal had stormed almost $40 higher at one point to reach $1,980 an ounce XAU=, only for a wave of selling to slap it back to $1,947 in wild trade."
    },
    {
        "content": "The government is planning to introduce fresh quality curbs on 371 goods that are mostly imported on China. The move comes recently after the government banned 47 fresh Chinese applications."
    },
    {
        "content": "The NSE Nifty 50 index gained 0.52 per cent to 11,184.25 by 9:19 am and the S&P BSE Sensex rose 0.47% to 38,104.57."
    },
    {
        "content": "Even as cases and intermittent lockdowns threaten India's employment recovery rate, fresh data gives a fresh ray of hope to urban job seekers in the country."
    },
    {
        "content": "Sources said government officials are holding regular meetings with corporate leaders on what is required for the next phase of economic recovery. Another stimulus package and a Covid fund are some of the popular suggestions given by corporates."
    }
]